lains/stm32-linky-display/src/main.cpp
/* Includes ------------------------------------------------------------------*/
#include "Stm32SerialDriver.h"
#include "Stm32LcdDriver.h"
#include "TIC/Unframer.h"
#include "TIC/DatasetExtractor.h"
#include "TIC/DatasetView.h"
#include <utility> // For std::swap()

extern "C" {
#include "main.h"
#include <string.h>
#include <stdio.h>
#include "font58.h"

static void SystemClock_Config(void); /* Defined below */
}

/* Private define ------------------------------------------------------------*/
const unsigned int LCDWidth = 800;
const unsigned int LCDHeight = 480;
const unsigned int BytesPerPixel = 4; /* For ARGB8888 mode */

#define VSYNC               1 
#define VBP                 1 
#define VFP                 1
#define VACT                LCDHeight
#define HSYNC               1
#define HBP                 1
#define HFP                 1
#define HACT                LCDWidth

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

//static uint32_t ImageIndex = 0;
/*static const uint32_t * Images[] = 
{
    image_320x240_argb8888,
    life_augmented_argb8888,
};*/

/**
  * @brief  On Error Handler on condition TRUE.
  * @param  condition : Can be TRUE or FALSE
  * @retval None
  */
void OnError_Handler(uint32_t condition)
{
    if(condition) {
        BSP_LED_On(LED2);
        while(1) { ; } /* Blocking on error */
    }
}

void Error_Handler() {
	  OnError_Handler(1);
}

typedef void(*FHalDelayRefreshFunc)(void* context);

/**
 * @brief Wait for a given delay in ms, while running a function in background
 * 
 * @param toRunWhileWaiting A function to run continously while waiting
 * @param context A context pointer provided to toRunWhileWaiting as argument
 * @param Delay The delay to wait for (in ms)
 * 
 */
void waitDelay(uint32_t Delay, FHalDelayRefreshFunc toRunWhileWaiting = nullptr, void* context = nullptr) {
    uint32_t tickstart = HAL_GetTick();
    uint32_t wait = Delay;

    /* Add a freq to guarantee minimum wait */
    if (wait < HAL_MAX_DELAY) {
        wait += (uint32_t)(uwTickFreq);
    }

    while((HAL_GetTick() - tickstart) < wait) {
        if (toRunWhileWaiting != nullptr) {
            toRunWhileWaiting(context);
        }
    }
}

/* Forward declarations */
class TicFrameParser;
class TicEvaluatedPower;
class TicMeasurements;
namespace std {
     void swap(TicEvaluatedPower& first, TicEvaluatedPower& second);
     void swap(TicMeasurements& first, TicMeasurements& second);
}

class TicEvaluatedPower {
public:
    TicEvaluatedPower() :
        isValid(false),
        minValue(static_cast<unsigned int>(-1)),
        maxValue(static_cast<unsigned int>(-1))
        { }

    TicEvaluatedPower(unsigned int minValue, unsigned int maxValue) :
        isValid(true),
        minValue(static_cast<unsigned int>(-1)),
        maxValue(static_cast<unsigned int>(-1)) {
            this->setMinMax(minValue, maxValue);
        }

    void setMinMax(unsigned int minValue, unsigned int maxValue) {
        this->isValid = true;
        if (minValue <= maxValue) {
            this->minValue = minValue;
            this->maxValue = maxValue;
        }
        else {
            this->minValue = maxValue;
            this->maxValue = minValue;

        }
    }
    void swapWith(TicEvaluatedPower& other) {
        std::swap(this->isValid, other.isValid);
        std::swap(this->minValue, other.minValue);
        std::swap(this->maxValue, other.maxValue);
    }

    friend void ::std::swap(TicEvaluatedPower& first, TicEvaluatedPower& second);

/* Attributes */
    bool isValid; /*!< Is this evaluated absolute power valid? */
    unsigned int minValue; /*!< Minimum possible power, in Watts) */
    unsigned int maxValue; /*!< Maximum possible power, in Watts) */
};

void std::swap(TicEvaluatedPower& first, TicEvaluatedPower& second) {
    first.swapWith(second);
}

class TicMeasurements {
public:
    TicMeasurements() :
        fromFrameNb(static_cast<unsigned int>(-1)),
        horodate(),
        instDrawnPower(static_cast<unsigned int>(-1)),
        instVoltage(static_cast<unsigned int>(-1)),
        instAbsCurrent(static_cast<unsigned int>(-1)),
        instEvalPower()
        { }

    TicMeasurements(unsigned int fromFrameNb) :
        fromFrameNb(fromFrameNb),
        horodate(),
        instDrawnPower(static_cast<unsigned int>(-1)),
        instVoltage(static_cast<unsigned int>(-1)),
        instAbsCurrent(static_cast<unsigned int>(-1)),
        instEvalPower()
        { }

    void reset() {
        this->fromFrameNb = static_cast<unsigned int>(-1);
        this->horodate = TIC::Horodate();
        this->instDrawnPower = static_cast<unsigned int>(-1);
        this->instVoltage = static_cast<unsigned int>(-1);
        this->instAbsCurrent = static_cast<unsigned int>(-1);
        this->instEvalPower = TicEvaluatedPower();
    }

    void swapWith(TicMeasurements& other) {
        std::swap(this->fromFrameNb, other.fromFrameNb);
        std::swap(this->horodate, other.horodate);
        std::swap(this->instDrawnPower, other.instDrawnPower);
        std::swap(this->instVoltage, other.instVoltage);
        std::swap(this->instAbsCurrent, other.instAbsCurrent);
        std::swap(this->maxSubscribedPower, other.maxSubscribedPower);
        std::swap(this->instEvalPower, other.instEvalPower);
    }

    friend void ::std::swap(TicMeasurements& first, TicMeasurements& second);

/* Attributes */
    unsigned int fromFrameNb; /*!< The TIC frame ID from which the enclosed data has been extracted */
    TIC::Horodate horodate; /*!< The optional horodate for the TIC frame */
    unsigned int instDrawnPower; /*!< The instantaneous (ie within the last TIC frame) withdrawn power, in Watts */
    unsigned int instVoltage; /*!< The instantaneous (ie within the last TIC frame) RMS voltage, in Volts */
    unsigned int instAbsCurrent; /*!< The instantaneous (ie within the last TIC frame) absolute current, in Amps */
    unsigned int maxSubscribedPower; /*!< The maximum allowed withdrawned power (subscribed), in Watts */
    TicEvaluatedPower instEvalPower; /*!< The instantaneous (ie within the last TIC frame) signed computed power (negative is injected, positive is withdrawn), in Amps */
};

void std::swap(TicMeasurements& first, TicMeasurements& second) {
    first.swapWith(second);
}

